Assignments/Assignment_2/celcius_to_kelvin_request.xml

<?xml version="1.0"?>

<soap:Envelope 
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope/" 
	soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding" >

	<soap:Header>
		<!-- placeholder -->
	</soap:Header>

	<soap:Body xmlns:conv="http://thewebsite.com/convert" >
		<conv:celciusToKelvin>
			<conv:celcius>10</conv:celcius>
		</conv:celciusToKelvin>
	  
	</soap:Body>

</soap:Envelope> 